# core1
# strings
# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
# #################################################################################
'''st = 'as 23 fdfdg544'

l=[num  for num in st if num.isdigit() ]
print(','.join(l))'''

st = 'as 23 fdfdg544'
# потрібно розділити числа від букв тобто про ітерувати  і isdigit()- чи складається із цифр.','.join()=об'єднює в рядок і роз поділяє комою
print(','.join([number for number in st if number.isdigit()]))
