# 1)Дан list:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - знайти мін число
#   - видалити усі дублікати
#   - замінити кожне 4-те значення на 'X'
import copy

# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
# 3) вывести табличку множення за допомогою цикла while
# 4) переробити це завдання під меню
#1 знайти мін число
l = [22, 3,5,2,8,2,-23, 8,23,5]
def min_from_list(l):
    return min(l)
# - видалити усі дублікати
def duplicate():
    copy=l.copy()
    print(list(set(copy)))
duplicate()
#  замінити кожне 4-те значення на 'X'к
#  буде мати індекс (і)
# print([for i,item in enumerate(copy)])
# кожне 4-те значення на 'X' (i+1)% 4 не починаємо з першого і ділемо на 4 і це буде кожне 4те
def to_x():
    copy = l.copy()
    print([ 'x' if  not (i+1)% 4 else item for i,item in enumerate(copy)])
to_x()
# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
def square(n): # квадрат яка приймає сторону (n)
    for i in range(n): # цикл # намалюємо * верх і низ зірками
        if i == 0 or i == n-1:      #якщо і==0 або його довжині і =п-1 то друкуватиме таку кількість зірок
            print('*'*n)  # маємо верх і низ
        else: # при умові якщо це не верх не низ то буде бокова
            print('*'+' '*(n-2)+'*') # *зліва додаємо пробіл і * (це довжтна квадрата -2)
square(5)
# 3) вывести табличку множення за допомогою цикла while
