# 1)Дан list:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - знайти мін число
#   - видалити усі дублікати
#   - замінити кожне 4-те значення на 'X'
import copy

# # 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
# # 3) вывести табличку множення за допомогою цикла while
# # 4) переробити це завдання під меню
#1 знайти мін число
l = [22, 3,5,2,8,2,-23, 8,23,5]
def min_from_list(l):
    return min(l)
#2 - видалити усі дублікати
def duplicate():
    copy=l.copy()
    print(list(set(copy)))
duplicate()
# 3 замінити кожне 4-те значення на 'X'к
#  буде мати індекс (і)
# print([for i,item in enumerate(copy)])
# кожне 4-те значення на 'X' (i+1)% 4 не починаємо з першого і ділемо на 4 і це буде кожне 4те
def to_x():
    copy = l.copy()
    print([ 'x' if  not (i+1)% 4 else item for i,item in enumerate(copy)])
to_x()
# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
def square(n): # квадрат яка приймає сторону (n)
    for i in range(n): # цикл # намалюємо * верх і низ зірками
        if i == 0 or i == n-1:      #якщо і==0 або його довжині і =п-1 то друкуватиме таку кількість зірок
            print('*'*n)  # маємо верх і низ
        else: # при умові якщо це не верх не низ то буде бокова
            print('*'+' '*(n-2)+'*') # *зліва додаємо пробіл і * (це довжтна квадрата -2)
square(5)
# 3) вывести табличку множення за допомогою цикла while

def multi_table():
    size= 9 # тобто таблиця до 9
    i= 1 #перший множник
    while i <= 9:
        j = 1 # другий множник
        while j <= 9:
            res = i * j
            print(' ' if res//10 else '  ', end='' )
            print(res, end='')
            # print(f'{res:2}', end=' ')
            j +=1
        print()
        i +=1
multi_table() # не показує всю таблицю потрібно уважно правильному рівні писати команди!!!!!!!!!!!!!!!!
# Починаємо з числа, для якого множимо (від 1 до 10)
# num = 1
#
# while num <= 10:  # Зовнішній цикл для чисел 1-10
#     multiplier = 1  # Лічильник множника, починаємо з 1
#
#     while multiplier <= 10:  # Внутрішній цикл для множення на 1-10
#         result = num * multiplier  # Обчислюємо добуток
#         print(f"{num} x {multiplier} = {result}")  # Виводимо результат
#         multiplier += 1  # Збільшуємо множник на 1
#
#     print("-" * 20)  # Додаємо роздільник після кожного числа
#     num += 1  # Переходимо до наступного числа

# 4) переробити це завдання під меню

while True:
    print('1)знайти мін число')
    print('2)видалити усі дублікати')
    print('3)замінити кожне 4-те значення на "X" ')
    print('4) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції')
    print('5) виести табличку множення за допомогою цикла while')
    print('6) вихід')

    choice= input('веди потрібне значення:  ')

    if choice == '1':
        print(min_from_list(l))
    elif choice == '2':(
        duplicate())
    elif choice == '3':
         to_x()
    elif choice == '4':
          square(5)
    elif choice == '5':
          multi_table()
    elif choice =='6':
        break

