# 🔹 Що таке Scope (Область видимості) у Python?
# Scope – це область програми, в якій можна отримати доступ до змінної.
# У Python існують 4 рівні областей видимості (LEGB Rule):
# 1️⃣ L (Local) – Локальна область (усередині функції).
# {2️⃣ E (Enclosing) – Локальна область зовнішньої функції (якщо є вкладені функції).}
# 3️⃣ G (Global) – Глобальна область (змінні, оголошені на верхньому рівні коду).
# {4️⃣ B (Built-in) – Вбудовані функції Python (наприклад, print() або len())}.

#(Global)
name= ' max'
#
# def fun():  # щоб залишити пусту ф-ю то  пишемо pass(пустишка яка наповню ф-ю або (...=рывносильно pass))
#     pass
#     (...)# те саме
#
# for i in range(5): # отже не помирають змінні які були створені за допомогою фор
#     print(i)
#
# print(i) # виводиться після закінчення циклу \4
# # є два види Scope  це (Local)- застосовується для функції (Global)=(змінні, оголошені на верхньому рівні коду)
# print(globals()) # все що створюю зміні вони попадають в скоп і ф-я не попадає сюди
#####################################################################################
# (Local)-для функції
# name='Oleh'
# def a():
#     name='Max'
#     print(locals()) #{'name': 'Max'} все що відбувається в ф. то і тут помирає
# print(globals())
# a() # запускаємо ф-ю
  #######################################################################################
# ЯК ПРАЦЮВАТИ з скоп
# name='Max'
#
# def a():
#     name='Vasia' # Max Max Max =якщо не дуде змін зовсім то дивиться глобально на верх
#
#     def b():
#         # nonlocal name # не потрібно брати ім'я з ф-ї b()name візьмеш із батькіської ф-ї а() дасть =Petia Petia Max,якщо не буде зміної в ф-ї а()
#         # то верх вона не подивиться і буде помилка
#         global name # якщо хочемо доступитися глобально до Мах-і це чітко вказуємо (теперт Мах буде перетертий Petia) # Petia Petia Petia
#        # при умові що немає зміної в а()
#         name='Petia' # Vasia Vasia Max якщо не буде цієї зміни то буде так
#         print(name)
#     b()
#     print(name)
#
# a()
# print(name)
# ВИКОРИСТАННЯ ЇХ можна при замикані цикл Local - не вилазить на зовні

#########################################################################
# використання в замикані counter() стандарте
def counter():
    count=0

    def inner(): #
        nonlocal count #   дивиться на  count=0
        count+=1    # збільшує на 1
        return count  #
    return inner # повертає саму ф-ю

counter_1=counter() # створюю багато
counter_2=counter() #

print(counter_1())  # запускаэмо ф-ю inner() оскільки вона повертає count і вона збільшується
print(counter_2())
print(counter_1())  #2
print(counter_1())  #3
print(counter_1())   #4
print(counter_2()) # всеодно дає порядок чисел 1 1 2 3 4 2

