# Дебагери (debuggers) у Python — це інструменти, які дозволяють покроково виконувати програму, щоб знайти і виправити помилки (баги).
# 🐞 Що можна робити з дебагером:
# Зупинити виконання коду в певному місці (breakpoint)
# Перевірити значення змінних у будь-який момент
# Крок за кроком пройти програму (step into, step over, step out)
# Відстежити порядок виконання коду 
# Зрозуміти, де програма «ламається» або працює не так, як очікувалося
#
# хочу розібрати код, то в тій точці потрібно поставити червону помітку брекбоинг називається і їх можна ставити
# декілька і правою кнопкою вибираємо дебаг4.Потім можу дивитися по кроково натискаючи F8- показує кожну дію коли виконали
# всі дії по кроково то вона виходить.Коли хочу подивитися функцію то нажимаємо F7 і тут видно по кроково в самій
# функції коли закінчиться то вийдемо із функціїї
res=[]

print('Hello')
def func():
    for i in range(10):
        tmp = i ** 2  # тимчасова зміна
        res.append(tmp)

func()
print('end')